#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/give-back-cincinnati/gbc-infra/runs/run-RkQyHB1z6rfFbMQE

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
data.cloudflare_zones.gbc: Reading...
data.cloudflare_zones.gbc: Read complete after 1s [id=86d947abd1990f315eb415450516882e]
cloudflare_record.gbc_next: Refreshing state... [id=a5db23132cde2c5180bb31b3609bb469]
cloudflare_page_rule.www_redirect: Refreshing state... [id=82e0b98b0e7ba0a373f495bfea3d464f]
cloudflare_zone_settings_override.gbc_dev_settings: Refreshing state... [id=f746dcf37d3a9a454301a1744e99af3b]
azurerm_resource_group.gbc: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources]
azurerm_virtual_network.gbc_vnet: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources/providers/Microsoft.Network/virtualNetworks/gbc-vnet]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources/providers/Microsoft.ContainerRegistry/registries/gbcCR]
azurerm_subnet.gbc_subnet: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources/providers/Microsoft.Network/virtualNetworks/gbc-vnet/subnets/gbc-subnet]
azurerm_kubernetes_cluster.gbc: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourcegroups/gbc-resources/providers/Microsoft.ContainerService/managedClusters/gbc-aks]
azurerm_public_ip.gbc: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/MC_gbc-resources_gbc-aks_eastus/providers/Microsoft.Network/publicIPAddresses/gbcPublicIp]
kubernetes_namespace.stage: Refreshing state... [id=stage]
kubernetes_namespace.prod: Refreshing state... [id=prod]
kubernetes_namespace.ingress: Refreshing state... [id=ingress-nginx]
kubernetes_namespace.vault: Refreshing state... [id=vault]
kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
kubernetes_namespace.new_relic: Refreshing state... [id=new-relic]
cloudflare_record.gbc_api: Refreshing state... [id=10ffaed1b982a77ffb8a27224edda9da]
cloudflare_record.vault: Refreshing state... [id=61901e39fc7cb7999a271d4d732f8ecb]
helm_release.redis: Refreshing state... [id=redis]
helm_release.cert-manager: Refreshing state... [id=gbc]
helm_release.vault: Refreshing state... [id=gbc]
helm_release.nginx_ingress: Refreshing state... [id=gbc]
helm_release.mongodb: Refreshing state... [id=mongodb]
aws_s3_bucket.cloudflare-bucket: Refreshing state... [id=gbc-static]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_resource_group.aks_resource_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "aks_resource_group" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "MC_gbc-resources_gbc-aks_eastus"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_kubernetes_cluster.gbc will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "gbc" {
        id                              = "/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourcegroups/gbc-resources/providers/Microsoft.ContainerService/managedClusters/gbc-aks"
        name                            = "gbc-aks"
        tags                            = {}
        # (14 unchanged attributes hidden)

      ~ default_node_pool {
          ~ max_count                    = 2 -> 3
          ~ min_count                    = 1 -> 2
            name                         = "default"
            tags                         = {}
            # (15 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # azurerm_public_ip.gbc must be replaced
-/+ resource "azurerm_public_ip" "gbc" {
      ~ availability_zone       = "Zone-Redundant" -> (known after apply)
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/MC_gbc-resources_gbc-aks_eastus/providers/Microsoft.Network/publicIPAddresses/gbcPublicIp" -> (known after apply)
      ~ ip_address              = "20.124.172.225" -> (known after apply)
      - ip_tags                 = {} -> null
      ~ location                = "eastus" -> (known after apply) # forces replacement
        name                    = "gbcPublicIp"
      - tags                    = {} -> null
      ~ zones                   = [] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_record.gbc_api will be updated in-place
  ~ resource "cloudflare_record" "gbc_api" {
      + allow_overwrite = false
        id              = "10ffaed1b982a77ffb8a27224edda9da"
        name            = "api.givebackcincinnati.org"
      ~ value           = "20.124.172.225" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # cloudflare_record.vault will be updated in-place
  ~ resource "cloudflare_record" "vault" {
      + allow_overwrite = false
        id              = "61901e39fc7cb7999a271d4d732f8ecb"
        name            = "vault.givebackcincinnati.org"
      ~ value           = "20.124.172.225" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # helm_release.nginx_ingress will be updated in-place
  ~ resource "helm_release" "nginx_ingress" {
        id                         = "gbc"
        name                       = "gbc"
      + pass_credentials           = false
        # (26 unchanged attributes hidden)

      - set {
          - name  = "replicaCount" -> null
          - value = "3" -> null
        }
      + set {
          + name  = "replicaCount"
          + value = "3"
        }
      - set {
          - name  = "service.loadBalancerIP" -> null
          - value = "20.124.172.225" -> null
        }
      + set {
          + name  = "service.loadBalancerIP"
          + value = (known after apply)
        }
      - set {
          - name  = "service.type" -> null
          - value = "LoadBalancer" -> null
        }
      + set {
          + name  = "service.type"
          + value = "LoadBalancer"
        }
    }

Plan: 1 to add, 4 to change, 1 to destroy.


```
</details>
*Pushed by: @MYoung25, Action: `pull_request`*